redisTestResult/redisMutiThreadsTestResultFix/redis_test_result_by_memtier_benchmark_FM_OFF_2nd/redis_result_Sequential110_FM_OFF_P1_2nd_20230719203942.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        32560.32          ---          ---         2.78850         2.83100         5.79100         6.07900     34886.19 
Gets         3254.83      3254.83         0.00         2.78838         2.83100         5.79100         6.11100      3468.27 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      35815.15      3254.83         0.00         2.78849         2.83100         5.79100         6.07900     38354.46 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.231        0.000
SET       2.175        5.000
SET       2.223       10.000
SET       2.271       15.000
SET       2.351       20.000
SET       2.479       25.000
SET       2.623       30.000
SET       2.735       35.000
SET       2.783       40.000
SET       2.815       45.000
SET       2.831       50.000
SET       2.847       52.500
SET       2.847       55.000
SET       2.863       57.500
SET       2.879       60.000
SET       2.879       62.500
SET       2.895       65.000
SET       2.911       67.500
SET       2.911       70.000
SET       2.927       72.500
SET       2.927       75.000
SET       2.943       76.250
SET       2.943       77.500
SET       2.943       78.750
SET       2.959       80.000
SET       2.959       81.250
SET       2.975       82.500
SET       2.975       83.750
SET       2.975       85.000
SET       2.991       86.250
SET       2.991       87.500
SET       3.007       88.125
SET       3.007       88.750
SET       3.007       89.375
SET       3.023       90.000
SET       3.023       90.625
SET       3.039       91.250
SET       3.039       91.875
SET       3.055       92.500
SET       3.055       93.125
SET       3.071       93.750
SET       3.087       94.062
SET       3.103       94.375
SET       3.103       94.688
SET       3.135       95.000
SET       3.151       95.312
SET       3.183       95.625
SET       3.231       95.938
SET       3.295       96.250
SET       3.663       96.562
SET       4.287       96.875
SET       4.383       97.031
SET       4.511       97.188
SET       4.607       97.344
SET       4.831       97.500
SET       5.055       97.656
SET       5.407       97.812
SET       5.503       97.969
SET       5.567       98.125
SET       5.631       98.281
SET       5.663       98.438
SET       5.695       98.516
SET       5.695       98.594
SET       5.727       98.672
SET       5.727       98.750
SET       5.759       98.828
SET       5.759       98.906
SET       5.791       98.984
SET       5.791       99.062
SET       5.823       99.141
SET       5.855       99.219
SET       5.855       99.258
SET       5.855       99.297
SET       5.855       99.336
SET       5.887       99.375
SET       5.887       99.414
SET       5.887       99.453
SET       5.919       99.492
SET       5.919       99.531
SET       5.919       99.570
SET       5.951       99.609
SET       5.951       99.629
SET       5.951       99.648
SET       5.951       99.668
SET       5.951       99.688
SET       5.983       99.707
SET       5.983       99.727
SET       5.983       99.746
SET       5.983       99.766
SET       6.015       99.785
SET       6.015       99.805
SET       6.015       99.814
SET       6.015       99.824
SET       6.047       99.834
SET       6.047       99.844
SET       6.047       99.854
SET       6.047       99.863
SET       6.047       99.873
SET       6.079       99.883
SET       6.079       99.893
SET       6.111       99.902
SET       6.111       99.907
SET       6.111       99.912
SET       6.143       99.917
SET       6.143       99.922
SET       6.143       99.927
SET       6.175       99.932
SET       6.207       99.937
SET       6.239       99.941
SET       6.271       99.946
SET       6.335       99.951
SET       6.335       99.954
SET       6.367       99.956
SET       6.367       99.958
SET       6.399       99.961
SET       6.431       99.963
SET       6.431       99.966
SET       6.463       99.968
SET       6.495       99.971
SET       6.527       99.973
SET       6.559       99.976
SET       6.591       99.977
SET       6.591       99.978
SET       6.623       99.979
SET       6.687       99.980
SET       6.719       99.982
SET       6.783       99.983
SET       6.815       99.984
SET       6.911       99.985
SET       7.071       99.987
SET       7.199       99.988
SET       7.327       99.988
SET       7.423       99.989
SET       7.519       99.990
SET       7.615       99.990
SET       7.679       99.991
SET       7.807       99.991
SET       7.999       99.992
SET       8.191       99.993
SET       8.511       99.993
SET       8.639       99.994
SET       8.831       99.994
SET       9.023       99.995
SET       9.087       99.995
SET       9.151       99.995
SET       9.151       99.995
SET       9.407       99.996
SET       9.535       99.996
SET       9.855       99.996
SET      10.751       99.997
SET      10.879       99.997
SET      11.391       99.997
SET      11.455       99.997
SET      11.519       99.997
SET      11.775       99.998
SET      11.775       99.998
SET      11.903       99.998
SET      12.223       99.998
SET      12.543       99.998
SET      12.607       99.998
SET      12.607       99.998
SET      12.671       99.999
SET      12.671       99.999
SET      12.735       99.999
SET      12.799       99.999
SET      12.799       99.999
SET      12.799       99.999
[...]
SET      12.863       99.999
SET      13.631       99.999
SET      13.631       99.999
SET      14.079       99.999
SET      14.079       99.999
SET      14.271       99.999
SET      14.271       99.999
SET      14.335       99.999
SET      14.335      100.000
SET      16.511      100.000
SET      16.511      100.000
SET      20.095      100.000
SET      20.095      100.000
SET      20.095      100.000
[...]
SET      20.223      100.000
SET      20.223      100.000
---
GET       0.487        0.000
GET       2.175        5.000
GET       2.223       10.000
GET       2.287       15.000
GET       2.351       20.000
GET       2.479       25.000
GET       2.623       30.000
GET       2.735       35.000
GET       2.783       40.000
GET       2.815       45.000
GET       2.831       50.000
GET       2.847       52.500
GET       2.863       55.000
GET       2.863       57.500
GET       2.879       60.000
GET       2.879       62.500
GET       2.895       65.000
GET       2.911       67.500
GET       2.911       70.000
GET       2.927       72.500
GET       2.927       75.000
GET       2.943       76.250
GET       2.943       77.500
GET       2.943       78.750
GET       2.959       80.000
GET       2.959       81.250
GET       2.975       82.500
GET       2.975       83.750
GET       2.991       85.000
GET       2.991       86.250
GET       3.007       87.500
GET       3.007       88.125
GET       3.007       88.750
GET       3.007       89.375
GET       3.023       90.000
GET       3.023       90.625
GET       3.039       91.250
GET       3.039       91.875
GET       3.055       92.500
GET       3.055       93.125
GET       3.071       93.750
GET       3.087       94.062
GET       3.087       94.375
GET       3.103       94.688
GET       3.119       95.000
GET       3.151       95.312
GET       3.183       95.625
GET       3.215       95.938
GET       3.263       96.250
GET       3.439       96.562
GET       4.191       96.875
GET       4.351       97.031
GET       4.479       97.188
GET       4.575       97.344
GET       4.767       97.500
GET       4.991       97.656
GET       5.375       97.812
GET       5.503       97.969
GET       5.567       98.125
GET       5.631       98.281
GET       5.663       98.438
GET       5.663       98.516
GET       5.695       98.594
GET       5.727       98.672
GET       5.727       98.750
GET       5.759       98.828
GET       5.759       98.906
GET       5.791       98.984
GET       5.791       99.062
GET       5.823       99.141
GET       5.823       99.219
GET       5.855       99.258
GET       5.855       99.297
GET       5.855       99.336
GET       5.887       99.375
GET       5.887       99.414
GET       5.887       99.453
GET       5.887       99.492
GET       5.919       99.531
GET       5.919       99.570
GET       5.951       99.609
GET       5.951       99.629
GET       5.951       99.648
GET       5.951       99.668
GET       5.951       99.688
GET       5.951       99.707
GET       5.983       99.727
GET       5.983       99.746
GET       5.983       99.766
GET       6.015       99.785
GET       6.015       99.805
GET       6.015       99.814
GET       6.015       99.824
GET       6.047       99.834
GET       6.047       99.844
GET       6.047       99.854
GET       6.047       99.863
GET       6.079       99.873
GET       6.079       99.883
GET       6.079       99.893
GET       6.111       99.902
GET       6.111       99.907
GET       6.143       99.912
GET       6.143       99.917
GET       6.143       99.922
GET       6.143       99.927
GET       6.175       99.932
GET       6.207       99.937
GET       6.207       99.941
GET       6.239       99.946
GET       6.303       99.951
GET       6.303       99.954
GET       6.335       99.956
GET       6.335       99.958
GET       6.367       99.961
GET       6.399       99.963
GET       6.399       99.966
GET       6.463       99.968
GET       6.495       99.971
GET       6.527       99.973
GET       6.591       99.976
GET       6.623       99.977
GET       6.687       99.978
GET       6.719       99.979
GET       6.815       99.980
GET       6.847       99.982
GET       6.847       99.983
GET       7.007       99.984
GET       7.167       99.985
GET       7.551       99.987
GET       7.711       99.988
GET       7.711       99.988
GET       8.159       99.989
GET       8.447       99.990
GET       8.895       99.990
GET       8.895       99.991
GET       8.895       99.991
GET       9.151       99.992
GET       9.151       99.993
GET       9.215       99.993
GET       9.727       99.994
GET       9.727       99.994
GET       9.727       99.995
GET       9.919       99.995
GET       9.919       99.995
GET      10.111       99.995
GET      10.111       99.996
GET      10.111       99.996
GET      11.263       99.996
GET      11.263       99.997
GET      11.775       99.997
GET      11.775       99.997
GET      11.775       99.997
[...]
GET      11.775       99.998
GET      12.415       99.998
GET      12.415       99.998
GET      12.415       99.998
[...]
GET      12.671       99.998
GET      12.671       99.999
GET      12.671       99.999
GET      12.671       99.999
[...]
GET      13.887       99.999
GET      13.887      100.000
---
WAIT      0.000      100.000